MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS505/mcu.h
#define _PGA2CON_PGAOEN_POSITION                 0x0000000E
#define _PGA2CON_PGAOEN_MASK                     0x00004000
#define _PGA2CON_PGAOEN_LENGTH                   0x00000001

#define _PGA2CON_PGAEN_POSITION                  0x0000000F
#define _PGA2CON_PGAEN_MASK                      0x00008000
#define _PGA2CON_PGAEN_LENGTH                    0x00000001

#define _PGA2CON_GAIN0_POSITION                  0x00000000
#define _PGA2CON_GAIN0_MASK                      0x00000001
#define _PGA2CON_GAIN0_LENGTH                    0x00000001

#define _PGA2CON_GAIN1_POSITION                  0x00000001
#define _PGA2CON_GAIN1_MASK                      0x00000002
#define _PGA2CON_GAIN1_LENGTH                    0x00000001

#define _PGA2CON_GAIN2_POSITION                  0x00000002
#define _PGA2CON_GAIN2_MASK                      0x00000004
#define _PGA2CON_GAIN2_LENGTH                    0x00000001

#define _PGA2CON_SELNI0_POSITION                 0x00000008
#define _PGA2CON_SELNI0_MASK                     0x00000100
#define _PGA2CON_SELNI0_LENGTH                   0x00000001

#define _PGA2CON_SELNI1_POSITION                 0x00000009
#define _PGA2CON_SELNI1_MASK                     0x00000200
#define _PGA2CON_SELNI1_LENGTH                   0x00000001

#define _PGA2CON_SELNI2_POSITION                 0x0000000A
#define _PGA2CON_SELNI2_MASK                     0x00000400
#define _PGA2CON_SELNI2_LENGTH                   0x00000001

#define _PGA2CON_SELPI0_POSITION                 0x0000000B
#define _PGA2CON_SELPI0_MASK                     0x00000800
#define _PGA2CON_SELPI0_LENGTH                   0x00000001

#define _PGA2CON_SELPI1_POSITION                 0x0000000C
#define _PGA2CON_SELPI1_MASK                     0x00001000
#define _PGA2CON_SELPI1_LENGTH                   0x00000001

#define _PGA2CON_SELPI2_POSITION                 0x0000000D
#define _PGA2CON_SELPI2_MASK                     0x00002000
#define _PGA2CON_SELPI2_LENGTH                   0x00000001

#define _PGA2CAL_PGACAL_POSITION                 0x00000000
#define _PGA2CAL_PGACAL_MASK                     0x0000003F
#define _PGA2CAL_PGACAL_LENGTH                   0x00000006

#define _CMP1CON_RANGE_POSITION                  0x00000000
#define _CMP1CON_RANGE_MASK                      0x00000001
#define _CMP1CON_RANGE_LENGTH                    0x00000001

#define _CMP1CON_CMPPOL_POSITION                 0x00000001
#define _CMP1CON_CMPPOL_MASK                     0x00000002
#define _CMP1CON_CMPPOL_LENGTH                   0x00000001

#define _CMP1CON_ALTINP_POSITION                 0x00000002
#define _CMP1CON_ALTINP_MASK                     0x00000004
#define _CMP1CON_ALTINP_LENGTH                   0x00000001

#define _CMP1CON_CMPSTAT_POSITION                0x00000003
#define _CMP1CON_CMPSTAT_MASK                    0x00000008
#define _CMP1CON_CMPSTAT_LENGTH                  0x00000001

#define _CMP1CON_HYSPOL_POSITION                 0x00000004
#define _CMP1CON_HYSPOL_MASK                     0x00000010
#define _CMP1CON_HYSPOL_LENGTH                   0x00000001

#define _CMP1CON_EXTREF_POSITION                 0x00000005
#define _CMP1CON_EXTREF_MASK                     0x00000020
#define _CMP1CON_EXTREF_LENGTH                   0x00000001

#define _CMP1CON_INSEL_POSITION                  0x00000006
#define _CMP1CON_INSEL_MASK                      0x000000C0
#define _CMP1CON_INSEL_LENGTH                    0x00000002

#define _CMP1CON_DACOE_POSITION                  0x00000008
#define _CMP1CON_DACOE_MASK                      0x00000100
#define _CMP1CON_DACOE_LENGTH                    0x00000001

#define _CMP1CON_FCLKSEL_POSITION                0x00000009
#define _CMP1CON_FCLKSEL_MASK                    0x00000200
#define _CMP1CON_FCLKSEL_LENGTH                  0x00000001

#define _CMP1CON_FLTREN_POSITION                 0x0000000A
#define _CMP1CON_FLTREN_MASK                     0x00000400
#define _CMP1CON_FLTREN_LENGTH                   0x00000001

#define _CMP1CON_HYSSEL_POSITION                 0x0000000B
#define _CMP1CON_HYSSEL_MASK                     0x00001800
#define _CMP1CON_HYSSEL_LENGTH                   0x00000002

#define _CMP1CON_CMPSIDL_POSITION                0x0000000D
#define _CMP1CON_CMPSIDL_MASK                    0x00002000
#define _CMP1CON_CMPSIDL_LENGTH                  0x00000001

#define _CMP1CON_CMPON_POSITION                  0x0000000F
#define _CMP1CON_CMPON_MASK                      0x00008000
#define _CMP1CON_CMPON_LENGTH                    0x00000001

#define _CMP1CON_INSEL0_POSITION                 0x00000006
#define _CMP1CON_INSEL0_MASK                     0x00000040
#define _CMP1CON_INSEL0_LENGTH                   0x00000001

#define _CMP1CON_INSEL1_POSITION                 0x00000007
#define _CMP1CON_INSEL1_MASK                     0x00000080
#define _CMP1CON_INSEL1_LENGTH                   0x00000001

#define _CMP1CON_HYSSEL0_POSITION                0x0000000B
#define _CMP1CON_HYSSEL0_MASK                    0x00000800
#define _CMP1CON_HYSSEL0_LENGTH                  0x00000001

#define _CMP1CON_HYSSEL1_POSITION                0x0000000C
#define _CMP1CON_HYSSEL1_MASK                    0x00001000
#define _CMP1CON_HYSSEL1_LENGTH                  0x00000001

#define _CMP1DAC_CMREF_POSITION                  0x00000000
#define _CMP1DAC_CMREF_MASK                      0x00000FFF
#define _CMP1DAC_CMREF_LENGTH                    0x0000000C

#define _CMP1DAC_CMREF0_POSITION                 0x00000000
#define _CMP1DAC_CMREF0_MASK                     0x00000001
#define _CMP1DAC_CMREF0_LENGTH                   0x00000001

#define _CMP1DAC_CMREF1_POSITION                 0x00000001
#define _CMP1DAC_CMREF1_MASK                     0x00000002
#define _CMP1DAC_CMREF1_LENGTH                   0x00000001

#define _CMP1DAC_CMREF2_POSITION                 0x00000002
#define _CMP1DAC_CMREF2_MASK                     0x00000004
#define _CMP1DAC_CMREF2_LENGTH                   0x00000001

#define _CMP1DAC_CMREF3_POSITION                 0x00000003
#define _CMP1DAC_CMREF3_MASK                     0x00000008
#define _CMP1DAC_CMREF3_LENGTH                   0x00000001

#define _CMP1DAC_CMREF4_POSITION                 0x00000004
#define _CMP1DAC_CMREF4_MASK                     0x00000010
#define _CMP1DAC_CMREF4_LENGTH                   0x00000001

#define _CMP1DAC_CMREF5_POSITION                 0x00000005
#define _CMP1DAC_CMREF5_MASK                     0x00000020
#define _CMP1DAC_CMREF5_LENGTH                   0x00000001

#define _CMP1DAC_CMREF6_POSITION                 0x00000006
#define _CMP1DAC_CMREF6_MASK                     0x00000040
#define _CMP1DAC_CMREF6_LENGTH                   0x00000001

