MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS505/mcu.h
#define _RPINR42_FLT5R1_POSITION                 0x00000001
#define _RPINR42_FLT5R1_MASK                     0x00000002
#define _RPINR42_FLT5R1_LENGTH                   0x00000001

#define _RPINR42_FLT5R2_POSITION                 0x00000002
#define _RPINR42_FLT5R2_MASK                     0x00000004
#define _RPINR42_FLT5R2_LENGTH                   0x00000001

#define _RPINR42_FLT5R3_POSITION                 0x00000003
#define _RPINR42_FLT5R3_MASK                     0x00000008
#define _RPINR42_FLT5R3_LENGTH                   0x00000001

#define _RPINR42_FLT5R4_POSITION                 0x00000004
#define _RPINR42_FLT5R4_MASK                     0x00000010
#define _RPINR42_FLT5R4_LENGTH                   0x00000001

#define _RPINR42_FLT5R5_POSITION                 0x00000005
#define _RPINR42_FLT5R5_MASK                     0x00000020
#define _RPINR42_FLT5R5_LENGTH                   0x00000001

#define _RPINR42_FLT5R6_POSITION                 0x00000006
#define _RPINR42_FLT5R6_MASK                     0x00000040
#define _RPINR42_FLT5R6_LENGTH                   0x00000001

#define _RPINR42_FLT5R7_POSITION                 0x00000007
#define _RPINR42_FLT5R7_MASK                     0x00000080
#define _RPINR42_FLT5R7_LENGTH                   0x00000001

#define _RPINR42_FLT6R0_POSITION                 0x00000008
#define _RPINR42_FLT6R0_MASK                     0x00000100
#define _RPINR42_FLT6R0_LENGTH                   0x00000001

#define _RPINR42_FLT6R1_POSITION                 0x00000009
#define _RPINR42_FLT6R1_MASK                     0x00000200
#define _RPINR42_FLT6R1_LENGTH                   0x00000001

#define _RPINR42_FLT6R2_POSITION                 0x0000000A
#define _RPINR42_FLT6R2_MASK                     0x00000400
#define _RPINR42_FLT6R2_LENGTH                   0x00000001

#define _RPINR42_FLT6R3_POSITION                 0x0000000B
#define _RPINR42_FLT6R3_MASK                     0x00000800
#define _RPINR42_FLT6R3_LENGTH                   0x00000001

#define _RPINR42_FLT6R4_POSITION                 0x0000000C
#define _RPINR42_FLT6R4_MASK                     0x00001000
#define _RPINR42_FLT6R4_LENGTH                   0x00000001

#define _RPINR42_FLT6R5_POSITION                 0x0000000D
#define _RPINR42_FLT6R5_MASK                     0x00002000
#define _RPINR42_FLT6R5_LENGTH                   0x00000001

#define _RPINR42_FLT6R6_POSITION                 0x0000000E
#define _RPINR42_FLT6R6_MASK                     0x00004000
#define _RPINR42_FLT6R6_LENGTH                   0x00000001

#define _RPINR42_FLT6R7_POSITION                 0x0000000F
#define _RPINR42_FLT6R7_MASK                     0x00008000
#define _RPINR42_FLT6R7_LENGTH                   0x00000001

#define _RPINR43_FLT7R_POSITION                  0x00000000
#define _RPINR43_FLT7R_MASK                      0x000000FF
#define _RPINR43_FLT7R_LENGTH                    0x00000008

#define _RPINR43_FLT8R_POSITION                  0x00000008
#define _RPINR43_FLT8R_MASK                      0x0000FF00
#define _RPINR43_FLT8R_LENGTH                    0x00000008

#define _RPINR43_FLT7R0_POSITION                 0x00000000
#define _RPINR43_FLT7R0_MASK                     0x00000001
#define _RPINR43_FLT7R0_LENGTH                   0x00000001

#define _RPINR43_FLT7R1_POSITION                 0x00000001
#define _RPINR43_FLT7R1_MASK                     0x00000002
#define _RPINR43_FLT7R1_LENGTH                   0x00000001

#define _RPINR43_FLT7R2_POSITION                 0x00000002
#define _RPINR43_FLT7R2_MASK                     0x00000004
#define _RPINR43_FLT7R2_LENGTH                   0x00000001

#define _RPINR43_FLT7R3_POSITION                 0x00000003
#define _RPINR43_FLT7R3_MASK                     0x00000008
#define _RPINR43_FLT7R3_LENGTH                   0x00000001

#define _RPINR43_FLT7R4_POSITION                 0x00000004
#define _RPINR43_FLT7R4_MASK                     0x00000010
#define _RPINR43_FLT7R4_LENGTH                   0x00000001

#define _RPINR43_FLT7R5_POSITION                 0x00000005
#define _RPINR43_FLT7R5_MASK                     0x00000020
#define _RPINR43_FLT7R5_LENGTH                   0x00000001

#define _RPINR43_FLT7R6_POSITION                 0x00000006
#define _RPINR43_FLT7R6_MASK                     0x00000040
#define _RPINR43_FLT7R6_LENGTH                   0x00000001

#define _RPINR43_FLT7R7_POSITION                 0x00000007
#define _RPINR43_FLT7R7_MASK                     0x00000080
#define _RPINR43_FLT7R7_LENGTH                   0x00000001

#define _RPINR43_FLT8R0_POSITION                 0x00000008
#define _RPINR43_FLT8R0_MASK                     0x00000100
#define _RPINR43_FLT8R0_LENGTH                   0x00000001

#define _RPINR43_FLT8R1_POSITION                 0x00000009
#define _RPINR43_FLT8R1_MASK                     0x00000200
#define _RPINR43_FLT8R1_LENGTH                   0x00000001

#define _RPINR43_FLT8R2_POSITION                 0x0000000A
#define _RPINR43_FLT8R2_MASK                     0x00000400
#define _RPINR43_FLT8R2_LENGTH                   0x00000001

#define _RPINR43_FLT8R3_POSITION                 0x0000000B
#define _RPINR43_FLT8R3_MASK                     0x00000800
#define _RPINR43_FLT8R3_LENGTH                   0x00000001

#define _RPINR43_FLT8R4_POSITION                 0x0000000C
#define _RPINR43_FLT8R4_MASK                     0x00001000
#define _RPINR43_FLT8R4_LENGTH                   0x00000001

#define _RPINR43_FLT8R5_POSITION                 0x0000000D
#define _RPINR43_FLT8R5_MASK                     0x00002000
#define _RPINR43_FLT8R5_LENGTH                   0x00000001

#define _RPINR43_FLT8R6_POSITION                 0x0000000E
#define _RPINR43_FLT8R6_MASK                     0x00004000
#define _RPINR43_FLT8R6_LENGTH                   0x00000001

#define _RPINR43_FLT8R7_POSITION                 0x0000000F
#define _RPINR43_FLT8R7_MASK                     0x00008000
#define _RPINR43_FLT8R7_LENGTH                   0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_URERR_POSITION                   0x00000008
#define _NVMCON_URERR_MASK                       0x00000100
#define _NVMCON_URERR_LENGTH                     0x00000001

