MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS505/mcu.h
#define _IPC44_ADCMP0IP_POSITION                 0x00000004
#define _IPC44_ADCMP0IP_MASK                     0x00000070
#define _IPC44_ADCMP0IP_LENGTH                   0x00000003

#define _IPC44_ADCMP1IP_POSITION                 0x00000008
#define _IPC44_ADCMP1IP_MASK                     0x00000700
#define _IPC44_ADCMP1IP_LENGTH                   0x00000003

#define _IPC44_ADFLTR0IP_POSITION                0x0000000C
#define _IPC44_ADFLTR0IP_MASK                    0x00007000
#define _IPC44_ADFLTR0IP_LENGTH                  0x00000003

#define _IPC44_ADCMP0IP0_POSITION                0x00000004
#define _IPC44_ADCMP0IP0_MASK                    0x00000010
#define _IPC44_ADCMP0IP0_LENGTH                  0x00000001

#define _IPC44_ADCMP0IP1_POSITION                0x00000005
#define _IPC44_ADCMP0IP1_MASK                    0x00000020
#define _IPC44_ADCMP0IP1_LENGTH                  0x00000001

#define _IPC44_ADCMP0IP2_POSITION                0x00000006
#define _IPC44_ADCMP0IP2_MASK                    0x00000040
#define _IPC44_ADCMP0IP2_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP0_POSITION                0x00000008
#define _IPC44_ADCMP1IP0_MASK                    0x00000100
#define _IPC44_ADCMP1IP0_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP1_POSITION                0x00000009
#define _IPC44_ADCMP1IP1_MASK                    0x00000200
#define _IPC44_ADCMP1IP1_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP2_POSITION                0x0000000A
#define _IPC44_ADCMP1IP2_MASK                    0x00000400
#define _IPC44_ADCMP1IP2_LENGTH                  0x00000001

#define _IPC44_ADFLTR0IP0_POSITION               0x0000000C
#define _IPC44_ADFLTR0IP0_MASK                   0x00001000
#define _IPC44_ADFLTR0IP0_LENGTH                 0x00000001

#define _IPC44_ADFLTR0IP1_POSITION               0x0000000D
#define _IPC44_ADFLTR0IP1_MASK                   0x00002000
#define _IPC44_ADFLTR0IP1_LENGTH                 0x00000001

#define _IPC44_ADFLTR0IP2_POSITION               0x0000000E
#define _IPC44_ADFLTR0IP2_MASK                   0x00004000
#define _IPC44_ADFLTR0IP2_LENGTH                 0x00000001

#define _IPC45_ADFLTR1IP_POSITION                0x00000000
#define _IPC45_ADFLTR1IP_MASK                    0x00000007
#define _IPC45_ADFLTR1IP_LENGTH                  0x00000003

#define _IPC45_ADFLTR1IP0_POSITION               0x00000000
#define _IPC45_ADFLTR1IP0_MASK                   0x00000001
#define _IPC45_ADFLTR1IP0_LENGTH                 0x00000001

#define _IPC45_ADFLTR1IP1_POSITION               0x00000001
#define _IPC45_ADFLTR1IP1_MASK                   0x00000002
#define _IPC45_ADFLTR1IP1_LENGTH                 0x00000001

#define _IPC45_ADFLTR1IP2_POSITION               0x00000002
#define _IPC45_ADFLTR1IP2_MASK                   0x00000004
#define _IPC45_ADFLTR1IP2_LENGTH                 0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_DIV0ERR_POSITION                0x00000006
#define _INTCON1_DIV0ERR_MASK                    0x00000040
#define _INTCON1_DIV0ERR_LENGTH                  0x00000001

#define _INTCON1_SFTACERR_POSITION               0x00000007
#define _INTCON1_SFTACERR_MASK                   0x00000080
#define _INTCON1_SFTACERR_LENGTH                 0x00000001

#define _INTCON1_COVTE_POSITION                  0x00000008
#define _INTCON1_COVTE_MASK                      0x00000100
#define _INTCON1_COVTE_LENGTH                    0x00000001

#define _INTCON1_OVBTE_POSITION                  0x00000009
#define _INTCON1_OVBTE_MASK                      0x00000200
#define _INTCON1_OVBTE_LENGTH                    0x00000001

#define _INTCON1_OVATE_POSITION                  0x0000000A
#define _INTCON1_OVATE_MASK                      0x00000400
#define _INTCON1_OVATE_LENGTH                    0x00000001

#define _INTCON1_COVBERR_POSITION                0x0000000B
#define _INTCON1_COVBERR_MASK                    0x00000800
#define _INTCON1_COVBERR_LENGTH                  0x00000001

#define _INTCON1_COVAERR_POSITION                0x0000000C
#define _INTCON1_COVAERR_MASK                    0x00001000
#define _INTCON1_COVAERR_LENGTH                  0x00000001

#define _INTCON1_OVBERR_POSITION                 0x0000000D
#define _INTCON1_OVBERR_MASK                     0x00002000
#define _INTCON1_OVBERR_LENGTH                   0x00000001

#define _INTCON1_OVAERR_POSITION                 0x0000000E
#define _INTCON1_OVAERR_MASK                     0x00004000
#define _INTCON1_OVAERR_LENGTH                   0x00000001

#define _INTCON1_NSTDIS_POSITION                 0x0000000F
#define _INTCON1_NSTDIS_MASK                     0x00008000
#define _INTCON1_NSTDIS_LENGTH                   0x00000001

#define _INTCON2_INT0EP_POSITION                 0x00000000
#define _INTCON2_INT0EP_MASK                     0x00000001
#define _INTCON2_INT0EP_LENGTH                   0x00000001

#define _INTCON2_INT1EP_POSITION                 0x00000001
#define _INTCON2_INT1EP_MASK                     0x00000002
#define _INTCON2_INT1EP_LENGTH                   0x00000001

#define _INTCON2_INT2EP_POSITION                 0x00000002
#define _INTCON2_INT2EP_MASK                     0x00000004
#define _INTCON2_INT2EP_LENGTH                   0x00000001

#define _INTCON2_INT4EP_POSITION                 0x00000004
#define _INTCON2_INT4EP_MASK                     0x00000010
#define _INTCON2_INT4EP_LENGTH                   0x00000001

